stevenj/avr-libc3/include/avr/io/attiny461a.h
/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/* Timer/Counter0 Output Compare Match A Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Match A Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x10) /* Timer/Counter0 Output Compare Match A Interrupt Enable - SET */


/* Timer/Counter0 Output Compare Match B Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Match B Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x08) /* Timer/Counter0 Output Compare Match B Interrupt Enable - SET */


/* Timer/Counter0 Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x02) /* Timer/Counter0 Overflow Interrupt Enable - SET */


/* Timer/Counter0 Input Capture Interrupt Enable */
#define TC0_TICIE0_CLEAR_gc (0x00) /* Timer/Counter0 Input Capture Interrupt Enable - CLEAR */
#define TC0_TICIE0_SET_gc   (0x01) /* Timer/Counter0 Input Capture Interrupt Enable - SET */


/* Timer/Counter0 Output Compare Flag 0A */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag 0A - CLEAR */
#define TC0_OCF0A_SET_gc   (0x10) /* Timer/Counter0 Output Compare Flag 0A - SET */


/* Timer/Counter0 Output Compare Flag 0B */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag 0B - CLEAR */
#define TC0_OCF0B_SET_gc   (0x08) /* Timer/Counter0 Output Compare Flag 0B - SET */


/* Timer/Counter0 Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x02) /* Timer/Counter0 Overflow Flag - SET */


/* Timer/Counter0 Input Capture Flag */
#define TC0_ICF0_CLEAR_gc (0x00) /* Timer/Counter0 Input Capture Flag - CLEAR */
#define TC0_ICF0_SET_gc   (0x01) /* Timer/Counter0 Input Capture Flag - SET */


/* Timer/Counter 0 Width */
#define TC0_TCW0_CLEAR_gc (0x00) /* Timer/Counter 0 Width - CLEAR */
#define TC0_TCW0_SET_gc   (0x80) /* Timer/Counter 0 Width - SET */


/* Input Capture Mode Enable */
#define TC0_ICEN0_CLEAR_gc (0x00) /* Input Capture Mode Enable - CLEAR */
#define TC0_ICEN0_SET_gc   (0x40) /* Input Capture Mode Enable - SET */


/* Input Capture Noice Canceler */
#define TC0_ICNC0_CLEAR_gc (0x00) /* Input Capture Noice Canceler - CLEAR */
#define TC0_ICNC0_SET_gc   (0x20) /* Input Capture Noice Canceler - SET */


/* Input Capture Edge Select */
#define TC0_ICES0_CLEAR_gc (0x00) /* Input Capture Edge Select - CLEAR */
#define TC0_ICES0_SET_gc   (0x10) /* Input Capture Edge Select - SET */


/* Analog Comparator Input Capture Enable */
#define TC0_ACIC0_CLEAR_gc (0x00) /* Analog Comparator Input Capture Enable - CLEAR */
#define TC0_ACIC0_SET_gc   (0x08) /* Analog Comparator Input Capture Enable - SET */


/* Waveform Generation Mode */
#define TC0_WGM00_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_WGM00_SET_gc   (0x01) /* Waveform Generation Mode - SET */


/* Timer/Counter Synchronization Mode */
#define TC0_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC0_TSM_SET_gc   (0x10) /* Timer/Counter Synchronization Mode - SET */


/* Timer/Counter 0 Prescaler Reset */
#define TC0_PSR0_CLEAR_gc (0x00) /* Timer/Counter 0 Prescaler Reset - CLEAR */
#define TC0_PSR0_SET_gc   (0x08) /* Timer/Counter 0 Prescaler Reset - SET */


/* Clock Select */
#define TC0_CS0_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC0_CS0_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC0_CS0_VAL_0x02_gc (0x02) /* Running, CLK/8 */
#define TC0_CS0_VAL_0x03_gc (0x03) /* Running, CLK/64 */
#define TC0_CS0_VAL_0x04_gc (0x04) /* Running, CLK/256 */
#define TC0_CS0_VAL_0x05_gc (0x05) /* Running, CLK/1024 */
#define TC0_CS0_VAL_0x06_gc (0x06) /* Running, ExtClk Tx Falling Edge */
#define TC0_CS0_VAL_0x07_gc (0x07) /* Running, ExtClk Tx Rising Edge */


/* Compare Output Mode, Bits */
#define TC1_TCCR1A_COM1A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode, Bits */
#define TC1_TCCR1A_COM1B_gc(x) ((x<<4) & 0x30)

/* Force Output Compare Match 1A */
#define TC1_FOC1A_CLEAR_gc (0x00) /* Force Output Compare Match 1A - CLEAR */
#define TC1_FOC1A_SET_gc   (0x08) /* Force Output Compare Match 1A - SET */


/* Force Output Compare Match 1B */
#define TC1_FOC1B_CLEAR_gc (0x00) /* Force Output Compare Match 1B - CLEAR */
#define TC1_FOC1B_SET_gc   (0x04) /* Force Output Compare Match 1B - SET */


/* Pulse Width Modulator Enable */
#define TC1_PWM1A_CLEAR_gc (0x00) /* Pulse Width Modulator Enable - CLEAR */
#define TC1_PWM1A_SET_gc   (0x02) /* Pulse Width Modulator Enable - SET */


/* Pulse Width Modulator Enable */
#define TC1_PWM1B_CLEAR_gc (0x00) /* Pulse Width Modulator Enable - CLEAR */
#define TC1_PWM1B_SET_gc   (0x01) /* Pulse Width Modulator Enable - SET */


/* PWM Inversion Mode */
#define TC1_PWM1X_CLEAR_gc (0x00) /* PWM Inversion Mode - CLEAR */
#define TC1_PWM1X_SET_gc   (0x80) /* PWM Inversion Mode - SET */


/* Timer/Counter 1 Prescaler reset */
#define TC1_PSR1_CLEAR_gc (0x00) /* Timer/Counter 1 Prescaler reset - CLEAR */
#define TC1_PSR1_SET_gc   (0x40) /* Timer/Counter 1 Prescaler reset - SET */


/* Dead Time Prescaler */
#define TC1_DTPS1_VAL_0x00_gc (0x00<<4) /* 1x */
#define TC1_DTPS1_VAL_0x01_gc (0x01<<4) /* 2x */
#define TC1_DTPS1_VAL_0x02_gc (0x02<<4) /* 4x */
#define TC1_DTPS1_VAL_0x03_gc (0x03<<4) /* 8x */


/* Clock Select Bits */
#define TC1_CS1_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC1_CS1_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC1_CS1_VAL_0x02_gc (0x02) /* Running, CLK/2 */
#define TC1_CS1_VAL_0x03_gc (0x03) /* Running, CLK/4 */
#define TC1_CS1_VAL_0x04_gc (0x04) /* Running, CLK/8 */
#define TC1_CS1_VAL_0x05_gc (0x05) /* Running, CLK/16 */
#define TC1_CS1_VAL_0x06_gc (0x06) /* Running, CLK/32 */
#define TC1_CS1_VAL_0x07_gc (0x07) /* Running, CLK/64 */
#define TC1_CS1_VAL_0x08_gc (0x08) /* Running, CLK/128 */
#define TC1_CS1_VAL_0x09_gc (0x09) /* Running, CLK/256 */
#define TC1_CS1_VAL_0x0A_gc (0x0A) /* Running, CLK/512 */
#define TC1_CS1_VAL_0x0B_gc (0x0B) /* Running, CLK/1024 */
#define TC1_CS1_VAL_0x0C_gc (0x0C) /* Running, CLK/2048 */
#define TC1_CS1_VAL_0x0D_gc (0x0D) /* Running, CLK/4096 */
#define TC1_CS1_VAL_0x0E_gc (0x0E) /* Running, CLK/8192 */
#define TC1_CS1_VAL_0x0F_gc (0x0F) /* Running, CLK/16384 */


/* COM1A1 Shadow Bit */
#define TC1_COM1A1S_CLEAR_gc (0x00) /* COM1A1 Shadow Bit - CLEAR */
#define TC1_COM1A1S_SET_gc   (0x80) /* COM1A1 Shadow Bit - SET */


/* COM1A0 Shadow Bit */
#define TC1_COM1A0S_CLEAR_gc (0x00) /* COM1A0 Shadow Bit - CLEAR */
#define TC1_COM1A0S_SET_gc   (0x40) /* COM1A0 Shadow Bit - SET */


