stevenj/avr-libc3/include/avr/io/attiny461a.h
/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE      _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB      _SFR_MEM8 (0x0036) /* Port B Input Pins */
#define PORTBB_DDRB      _SFR_MEM8 (0x0037) /* Port B Data Direction Register */
#define PORTBB_PORTB     _SFR_MEM8 (0x0038) /* Port B Data Register */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE         _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_DIDR0        _SFR_MEM8 (0x0021) /* Digital Input Disable Register 0 */
#define ADC_DIDR1        _SFR_MEM8 (0x0022) /* Digital Input Disable Register 1 */
#define ADC_ADCSRB       _SFR_MEM8 (0x0023) /* ADC Control and Status Register B */
#define ADC_ADC          _SFR_MEM16(0x0024) /* ADC Data Register  Bytes */
#define ADC_ADCL         _SFR_MEM8 (0x0024) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH         _SFR_MEM8 (0x0025) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSRA       _SFR_MEM8 (0x0026) /* The ADC Control and Status register */
#define ADC_ADMUX        _SFR_MEM8 (0x0027) /* The ADC multiplexer Selection Register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE          _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSRA         _SFR_MEM8 (0x0028) /* Analog Comparator Control And Status Register A */
#define AC_ACSRB         _SFR_MEM8 (0x0029) /* Analog Comparator Control And Status Register B */

/* USI - Universal Serial Interface (0x0000) */
#define USI_BASE         _SFR_MEM8 (0x0000) /* USI Base Address */
#define USI_USICR        _SFR_MEM8 (0x002D) /* USI Control Register */
#define USI_USISR        _SFR_MEM8 (0x002E) /* USI Status Register */
#define USI_USIDR        _SFR_MEM8 (0x002F) /* USI Data Register */
#define USI_USIBR        _SFR_MEM8 (0x0030) /* USI Buffer Register */
#define USI_USIPP        _SFR_MEM8 (0x0031) /* USI Pin Position */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE      _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR      _SFR_MEM16(0x003E) /* EEPROM Address Register  Bytes */
#define EEPROM_EEARL     _SFR_MEM8 (0x003E) /* EEPROM Address Register  Bytes LOW BYTE */
#define EEPROM_EEARH     _SFR_MEM8 (0x003F) /* EEPROM Address Register  Bytes HIGH BYTE */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE         _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR        _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE         _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_OCR0B        _SFR_MEM8 (0x0032) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0A        _SFR_MEM8 (0x0033) /* Timer/Counter0 Output Compare Register */
#define TC8_TCNT0H       _SFR_MEM8 (0x0034) /* Timer/Counter0 High */
#define TC8_TCCR0A       _SFR_MEM8 (0x0035) /* Timer/Counter  Control Register A */
#define TC8_TCNT0L       _SFR_MEM8 (0x0052) /* Timer/Counter0 Low */
#define TC8_TCCR0B       _SFR_MEM8 (0x0053) /* Timer/Counter Control Register B */
#define TC8_TIFR         _SFR_MEM8 (0x0058) /* Timer/Counter0 Interrupt Flag register */
#define TC8_TIMSK        _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* TC1 - Timer/Counter, 8-bit (0x0000) */
/* TC8_BASE ALREADY DEFINED */
#define TC8_TCCR1E       _SFR_MEM8 (0x0020) /* Timer/Counter1 Control Register E */
#define TC8_DT1          _SFR_MEM8 (0x0044) /* Timer/Counter 1 Dead Time Value */
#define TC8_TC1H         _SFR_MEM8 (0x0045) /* Timer/Counter 1 Register High */
#define TC8_TCCR1D       _SFR_MEM8 (0x0046) /* Timer/Counter Control Register D */
#define TC8_TCCR1C       _SFR_MEM8 (0x0047) /* Timer/Counter Control Register C */
#define TC8_OCR1D        _SFR_MEM8 (0x004A) /* Output compare register */
#define TC8_OCR1C        _SFR_MEM8 (0x004B) /* Output compare register */
#define TC8_OCR1B        _SFR_MEM8 (0x004C) /* Output Compare Register */
#define TC8_OCR1A        _SFR_MEM8 (0x004D) /* Output Compare Register */
#define TC8_TCNT1        _SFR_MEM8 (0x004E) /* Timer/Counter Register */
#define TC8_TCCR1B       _SFR_MEM8 (0x004F) /* Timer/Counter Control Register B */
#define TC8_TCCR1A       _SFR_MEM8 (0x0050) /* Timer/Counter Control Register A */
/* TC8_TIFR ALREADY DEFINED */
/* TC8_TIMSK ALREADY DEFINED */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0       _SFR_MEM8 (0x002A) /* General purpose register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x002B) /* General Purpose register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x002C) /* General Purpose IO register 2 */
#define CPU_DWDR         _SFR_MEM8 (0x0040) /* debugWire data register */
#define CPU_CLKPR        _SFR_MEM8 (0x0048) /* Clock Prescale Register */
#define CPU_PLLCSR       _SFR_MEM8 (0x0049) /* PLL Control and status register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Register */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_PRR          _SFR_MEM8 (0x0056) /* Power Reduction Register */
#define CPU_SP           _SFR_MEM16(0x005D) /* Stack Pointer  Bytes */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer  Bytes LOW BYTE */
#define CPU_SPH          _SFR_MEM8 (0x005E) /* Stack Pointer  Bytes HIGH BYTE */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK1     _SFR_MEM8 (0x0042) /* Pin Change Enable Mask 1 */
#define EXINT_PCMSK0     _SFR_MEM8 (0x0043) /* Pin Change Enable Mask 0 */
#define EXINT_MCUCR      _SFR_MEM8 (0x0055) /* MCU Control Register */
#define EXINT_GIFR       _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK      _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

